app/controllers/comments_controller.rb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
---
	def index
		@picture = Picture.find(params[:picture_id])

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
---
	def new
		@picture = Picture.find(params[:picture_id])

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("content", "created_at", "name", "picture_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "wow"], ["created_at", Thu, 07 Nov 2013 22:49:35 UTC +00:00], ["name", "nola"], ["picture_id", 1], ["updated_at", Thu, 07 Nov 2013 22:49:35 UTC +00:00]]
---
	def create
		@picture = Picture.find(params[:picture_id])

		@comment = Comment.new(comment_params)
		@comment.picture = @picture
		# render :new => "#{params[:name]} #{params[:content]}"
		if @comment.save