app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures" ORDER BY title DESC
---
	def index
		@pictures = Picture.all #[
		# 	{
		# 		:title => "The old church on the coast of White sea",
		# 		:artist => "Sergey Ershov",
		# 		:url => "http://monicao.s3.amazonaws.com/bitmaker/house.jpg"

		# 		},
		# 	{
		# 		:title => "Sea Power",
		# 		:artist => "Stephen Scullion",
		# 		:url => "http://monicao.s3.amazonaws.com/bitmaker/wave.jpg"
		# 	},
		# 	{
		# 		:title => "Into the Poppies",
		# 		:artist => "John Wilhelm",
		# 		:url => "http://monicao.s3.amazonaws.com/bitmaker/girl.jpg"
		# 	}
		# ]

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@picture = Picture.find(params[:id])#[
		# 	{
		# 		:title => "The old church on the coast of the White sea",
		# 		:artist => "Sergey Ershov",
		# 		:url => "http://monicao.s3.amazonaws.com/bitmaker/house.jpg"

		# 	},
		# 	{
		# 		:title => "Sea Power",
		# 		:artist => "Stephen Scullion",
		# 		:url => "http://monicao.s3.amazonaws.com/bitmaker/wave.jpg"
		# 	},
		# 	{
		# 		:title => "Into the Poppies",
		# 		:artist => "John Wilhelm",
		# 		:url => "http://monicao.s3.amazonaws.com/bitmaker/girl.jpg"
		# 	}

		# ]

INSERT INTO "pictures" ("artist", "created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)
---
	def create
		#make a new picture with what picture_params returns (which is a method we're calling)
		@picture = Picture.new(picture_params)
		if @picture.save

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "pictures" SET "title" = ?, "updated_at" = ? WHERE "pictures"."id" = 5  [["title", "YouTube Music Awards - Tiffany Hwang"], ["updated_at", Mon, 04 Nov 2013 10:19:21 UTC +00:00]]
---
	def update
		@picture = Picture.find(params[:id])

		if @picture.update_attributes(picture_params)